Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 二楼的毛球见状，嘴角露出一抹恶趣味的笑容，旋即对游小默和凌霄说道：“主人，大人，我有点事情要办，城外见。”
en_us: MaoQiu, who was on the second floor saw this and her lips curled into a devious smile. Turning towards You XiaoMo and Ling Xiao she said, "Master, DaRen, I have something to attend to, I'll see you outside of the city."

source: 二楼破开一个大洞，里面正站着游小默三人，出手将黑熊踢飞的人正是凌霄，以黑熊十一阶七星的实力只要不遇到十二阶强者，确实可以称王称霸，但这一次他却注定要悲剧了。
en_us: On the second floor was now a huge hole and stood in front of it was You XiaoMo and the others. The one who kicked Hei Xiong flying was Ling Xiao. With Hei Xiong's power at level eleven seven stars, as long as he didn't meet a level twelve practitioner, he was truly the strongest (称王称霸), but this time it could only end up badly.

source: 二楼，游小默还不知道客栈的外来者已经有两个被做掉了。
en_us: On the second floor, You XiaoMo was wholly unaware that the other two outsiders were already gone.

source: 于是他们跑到一处无人的深山，让凌霄帮他护法。
en_us: So they ran to an uninhabited mountain and he let Ling Xiao be his guardian.

source: 于是他们离开集镇，直接去寻一处无人的深山。
en_us: So they left the town and went directly to find a place deep in the mountain without people.

source: 于是他假意要选下一任家主之位的继承人，将传族之宝一事透露给四个儿子知道，他知道四个儿子明里暗里培养了许多人脉。
en_us: Thus, he pretended that he was going to choose a successor for the position of Family Head and revealed the matter of the Inheritance Jewel to his four sons. He knew that his four sons had nurtured many connections both aboveground and underground.

source: 于是他客气的把游君其请进他的空间让他帮忙种灵草，他的空间本就是游君其给他的，所以无所谓里面的秘密会不会被他知道。
en_us: Thus, he courteously invited You JunQi into his dimension to help him plant magic herbs. His dimension was originally given to him by You JunQi, so he was indifferent as to whether the secret inside would be revealed to him.

source: 于是他就忍不住回了一句，哪想到，这个人竟然不分青红皂白，他什么偶读没做就想杀他。
en_us: Thus, he couldn't help but rebutted. How was he supposed to know that this person would want to kill him out of the blue like that.

source: 于是他把小乓带走了，乒乓球心意相通，如果这边遇到危险，小乓就能感应到，到时他会用最快的速度赶回来。
en_us: Therefore, he took Xiao Pang with him. The feels of Ping Pang Qiu were interconnected. If there was trouble on this side, Xiao Pang would be able to feel it and he would hurry back here at his fastest speed when the time comes.

source: 于是他每天至少给几株灵草浇水十几二十次，几株灵草长势颇为喜人，不出一个月，灵草就已经趋近成熟了。
en_us: So he watered the magic herbs at least ten to twenty times a day. They grew extremely satisfyingly; not even a month had passed before the magic herbs were close to maturing.

source: 于是他毫不犹豫的攻击了月亮，一记琉璃手过去，霎时把月亮拍扁了，幻阵立刻破了，只不过还没等他高兴的阐述破阵后的心得，他们就受到了攻击。
en_us: Thus, without hesitation he attacked the moon. With a Azure Hand attack(琉璃手), he slapped the moon flat. In an instant the illusion array was broken, but before he could feel happy about it and reflect on it, they were attacked .

source: 于是在游小默不知道的情况下，他的混球长歪了。
en_us: Thus, under circumstances unknown to You XiaoMo, his HunQiu had grown up crooked.

source: 于是才有今天这一幕。
en_us: Thus this scene came about today.

source: 于是水元素之心悄悄的潜到泉眼底下，开始执行它的计划。
en_us: So the Water Elemental Essence quietly slunk to the bottom of the spring and started to implement its plan.

source: 于是等好奇心满满的游小默顺着踪迹赶到目的地时，凌霄已经和黑袍男子打起来了。
en_us: Thus when You XiaoMo who was full of curiosity followed the tracks to his destination, Ling Xiao had already began to fight with the black-robed man.

source: 于是，这只突兀的黑鸦就成功的引起大家注意，包括守着入口的两个黑袍人。
en_us: Thus, the abrupt appearance of the black crow succeeded in attracting everyone's attention, including two black-robed men guarding the entrance.

source: 于是，不到两刻钟，掌柜再次敲响游小默的房门。
en_us: Thus, it wasn't even thirty minutes when the shopkeeper knocked on You XiaoMo's door again.

source: 于是，两人下午在山洞吃完最后剩下的烤肉就出发了。
en_us: Thus, the two left after finishing the last of the meat.

source: 于是，两人毅然把莫景的委托排在第二顺位，欢欢喜喜的前往目的地。
en_us: Thus, the two prioritized Mo Jing's entrustment as second without any hesitation and happily proceeded to their destination.

source: 于是，凌霄牵起他家夫人的手大摇大摆，光明正大的进入遗迹。
en_us: Thus, Ling Xiao held his wife's hand and walked in fair and square, with swagger.

source: 于是，刑七和高殷决定兵分两路。
en_us: Therefore, Xing Qi and Gao Yan decided to split up.

source: 于是，刚放出来没多久，游君其就被烦不胜烦的游小默又关回空间。
en_us: Thus, not long after he was released, You JunQi was shut into the dimension again by the extremely irritated You XiaoMo.

source: 于是，天刀把账算在了游小默身上，谁让傲慢鸟是游小默的契约兽，而傲慢鸟又是七罪兽之一，关系套在一起，债务就被天刀自然而然的算在游小默身上。
en_us: Thus, Tian Dao added it to You XiaoMo's bill. The Bird of Pride was his contracted demon beast, after all, and one of the Seven Sins Beasts. With that, You XiaoMo naturally had to take responsibility for their actions.

source: 于是，智商负二位数的游小默被他的夫君三两句话给哄完了，两人手拉手，高高兴兴的进入洞域。
en_us: Thus, the double digit You XiaoMo was calmed down by a few words of his husbands. The two then went hand in hand happily inside.

source: 于是，游小默和凌霄的房间就被小偷光顾了。
en_us: Hence, You XiaoMo and Ling Xiao's room was patronized by a thief.

source: 于是，游小默在姬云琅准备抵抗凌霄的火焰时，悄悄的攻击了他，姬云琅的动作只是顿了一下就被火焰缠上了。
en_us: Therefore, when Ji YunLang was about to resist Ling Xiao's fire, You XiaoMo had quietly attacked him. Ji YunLang's movements had only paused for a second before he was caught by the flames.

source: 于是，游小默抱着这个想法心安理得的住了下来。
en_us: Thus, with that thought in mind, You XiaoMo felt free to stay here.

source: 于是，灵草落入大手笔的凌霄手中。
en_us: Therefore, the magic herbs fell into master plotter Ling Xiao's hands.

source: 于是，男子和老板娘成了游小默拳头下第一个悲剧的产物。
en_us: As a result, the man and his wife was the first to become the products of tragedy under You XiaoMo's fist.

source: 于是，等狼狈不堪半只手臂被炸断的游震天再度出现时，两人已经逃得无影无踪，游震天愤怒的吼声几乎传到几千里远。
en_us: Thus, when the battered and exhausted You ZhenTian, who had half his arm blown off by the explosion, appeared again, the two had already fled without a trace. You ZhenTian's roar of rage could be heard from thousands of miles away.

source: 于是，这就是传说中的自作自受，亏他前戏还铺垫了那么长，果断找虐的体质！
en_us: Thus, this was the legendary, no zuo no die why you try. (自作自受) He planned out so much just for this? Is he an M?

source: 于步已经听熊师哥说过，没想到他竟然还有这么多，纯度接近百分之百的灵水很难得，用来交换两枚低等空间符很划算。
en_us: Yu Bu had heard Brother Xiong tell him about this, but he hadn't thought he would have so many. Spiritual water with a purity of almost 100 percent was rare; it was worth two low level teleportation talismans.

source: 于步似乎看穿他的疑惑，便解释道：“二位请放心，没有下禁制是我们兄弟之前的信任，不过我可以保证，玉简经过我的手后就没有一个人看过里面的东西，当然也包括我自己。”
en_us: Yu Bu seemed to see through his suspicions and explained, "Please, be at ease. The lack of seals is merely a sign of trust between us brothers, but I can promise that after the jade drive came to my hands, no one has seen what's inside, including me."

source: 于步拿出一枚玉简，递给他们：“这是熊师哥让我交给二位的玉简，你们要的消息都在里面。”
en_us: Yu Bu took out a jade drive and handed it over. "Brother Xiong wanted me to deliver this jade drive to you two. The information you're looking for is all in here."

source: 于步是熊笑的师弟，排名第三十一，虽然比较靠后，天赋也不是最好的，但是苍盟盟主的徒弟就没有一个是庸才。
en_us: Yu Bu was a younger martial brother of Xiong Xiao's, ranked thirty-one. Though he was ranked rather far back and wasn't the most talented, but the Cang Alliance's alliance head would never take in an ordinary disciple.

source: 于步笑了笑，“对了，熊师哥还让我拿一个东西给你们，他说你们应该会很需要。”说着他拿出一枚蓝色的玉符。
en_us: Yu Bu smiled. "Oh yeah, Brother Xiong also asked me to give you something. He said you might need it." He took out a blue jade talisman as he spoke.

source: 于步笑了起来，“不错，这枚空间符不是白送的，苍盟不做亏本的买卖，不过看在二位是熟人的份上，在下可以给二位打折。”
en_us: Yu Bu smiled. "That's right. He's not giving you this for free. The Cang Alliance doesn't make unprofitable business, but seeing that you two are regulars, I can give you a discount."

source: 于步解释道：“再过些天便是小师弟的生辰，这张是苍盟的邀请卡，届时请二位赏光来参加。”
en_us: Yu Bu explained, "It'll be our youngest martial brother's birthday celebration in a few days. This is an invite from the Cang Alliance, and we welcome you two to attend."

source: 于步说：“是空间符。”
en_us: Yu Bu said, "It's a space talisman."

source: 云少深呼吸一口气，“本少爷知道，但想拿出令丹师工会心动的东西恐怕很难，我身上最珍贵的也就只有那枚一品彩丹了。”
en_us: Yun Shao took a deep breath, "This Young Master knows, but I'm afraid that it would be difficult to be able to take out something that would move the Mage Association. The most valuable thing I have is only that first grade rainbow pill."

source: 云少表情阴晴不定的退回去，手中的折扇烦躁的摇着，眼睁睁的看着一张彩级丹方从他面前飞走，那种感觉和游小默有异曲同工之妙。
en_us: Yun Shao returned back with an obscure expression. The fan in his hand was shaking with irritability (烦躁). That feeling of looking on helplessly while a rainbow grade pill recipe flew away in front of him was uncannily parallel to You XiaoMo's.

source: 五分钟后，游小默怨念十足的拿着那块只剩下一个积分的牌子走出报名处，什么坑人的玩意，分明就不给人活路，还以为自己聪明的找到一条捷径，结果转个弯才发现有个坑人的洞在等着他。
en_us: Five minutes later, You XiaoMo walked out of the registration area with his one point tally in a fury. What a damn ripoff, not giving a single way out. He had thought he was smart enough to find a loophole, yet when he turned, another person was there to rip him off.

source: 五分钟后，两人到达私人交易所外面。
en_us: Five minutes later, the two of them arrived outside of the private Exchange Quarter.

source: 五方势力走了两支，剩下的人顿时压力倍增，特别是丹师工会的强者，因为他是所有人中实力最强的，而水妖向来喜欢先对付实力强大的。
en_us: Two of the five forces were gone, and the pressure on the remaining of the people doubled, especially for the expert from the Mage Association. This was because he was the strongest amongst all of them, and the Water Demons always liked to deal with the powerful person first.

source: 五点整，一个人突然出现在走廊上，在游小默的房门前停下来，当他敲了几声都没人回应时，这个人突然推开门走进去，半刻钟不到又走出来，慌慌张张的消失在走廊上。
en_us: At five o'clock, a person suddenly appeared in the hallway and stopped in front of You XiaoMo's door. After knocking for a few times without receiving any response, the person suddenly opened the door and walked in. He came out after less than eight minutes (半刻钟) and disappeared into the hallway in a flurried manner.

source: 五百株灵草一枚灵晶？
en_us: Five hundred magic herbs for a spirit gem?

source: 五秒后，一道谈笑声在他耳边响起。
en_us: Five seconds later, a light laughter sounded.

source: 五秒后，游小默的身影，哦不，是侍女的身影又出现在八层的楼梯转角处，那里刚好可以遮挡住守卫的视线，因为这些人都看到他被游单赶下来。
en_us: Five seconds later, You XiaoMo's figure, no, the handmaiden's figure appeared once more at the corner of floor eight's stairs. This area was hidden from the guards' lines of sight, because they had all seen him get chased down by You Dan.

source: 五长老对身边的叶长老说道：“你来解释吧。”
en_us: The Fifth Elder looked to Elder Ye who was beside him. “You explain.”

source: 五长老走出来，摸着胡子道：“若时间超过半个小时，则一律为六分。”
en_us: The Fifth Elder stepped forwards, stroking his beard and saying, “Anyone who gets anything over half an hour will obtain six points.”

source: 五长老走到众人面前，沉稳的目光扫过在场所有参赛者，淡然道：“既然所有人都到齐了，老夫便开始宣布接下来这一轮的比赛规则，所有人仔细听好了。”
en_us: The Fifth Elder walked to the front of the crowd, his calm gaze sweeping over the participants as he said, “Seeing that everyone is here, I’ll announce the rules. Listen carefully.”

source: 交易所分为三个区，一区为七十层到七十九层的导师，他们的要求一般比较低，所以给的积分也就低，不过这也和他们每个月分发的积分有直接的关系。
en_us: The Exchange Quarter was split into three blocks. Block 1 was for teachers of the 70th to 79th floor, and their requirements were usually pretty low, so they also gave fewer points. But this was also directly related to the amount of points they were given every month.

source: 交易过后，于步从储物袋拿出一张烫金的黑色帖子递给他们。
en_us: After their transactions, Yu Bu took out a gold-gilded black card and gave it to them.

source: 交易过后，游小默正准备走人，猫球突然从他的衣服里跳了出来，两颗圆溜溜的眼睛好奇地看了看，多么纯洁无辜！
en_us: You XiaoMo was preparing to leave after the transaction was completed, but suddenly CatQiu jumped out of his clothes. Two round eyes looked around curiously; so innocent and cute!

source: 亲爱的，你的节操丢哪去了，我帮你捡起来。
en_us: Darling, where has your filter gone, let me go and pick it up for you.

source: 亲眼看过后，老夫妇终于相信他的话。
en_us: After seeing it in person, the elderly couple finally believed what he said.

source: 人类变成水妖是没有生前记忆的，丹师也有特例的。
en_us: When humans transformed in a Water Demon, they hold no previous memories, however, there are some mages who are the exception.

source: 人群中的武成正要冲过去，却被两老给拉住。
en_us: Wu Cheng, who was in the crowd, wanted to charge over, but was stopped by his two elders.

source: 人群混杂，加上游小默刻意隐藏，姬芮一时间没有发现他。
en_us: It was a messy crowd and with You XiaoMo intentionally being stealthy, Ji Rui didn't discover him immediately.

source: 什么叫想抵哪条过错，难道他犯了很多错误吗？
en_us: What did he mean by 'which mistake you want to atone for', don't tell him that he had made many mistakes?

source: 什么叫我允许你先逃命。
en_us: What do you mean 'I will permit you to run for your life first'.

source: 什么有的没的。
en_us: What 'you have, I don't have.'

source: 什么破瓦片，质量明显不过关！
en_us: What kind of broken tile is this? The quality obviously could not pass the QC!

source: 今天是他炼化白虎一滴精血的日子，但事实上他已经闭关两个月了，白虎的精血比他想象中的还要难以炼化。
en_us: Today was the day that he would refine one drop of the White Tiger's Life Blood, but in reality, he had already undergone secluded cultivation for two months now. The White Tiger's Life Blood was even harder to refine than he had imagined.

source: 今年的比赛项目和去年不同，虽然也是测试丹师的灵魂，但今年是借用了甲级学区的学生平时训练的方法，所以对所有参赛者而言，他们都是第一次。
en_us: This year’s task was different from last year’s. Though it was also testing a mage’s soul, they were using a training method the students in ward A, so this was the first time for all the participants.

source: 今日的乌梅镇一如既往的热闹。
en_us: Today's Ebony Plum Town was as lively as ever.

source: 从中心城到乌梅镇这段路程，饱含了它太多太多的心酸了，或许它该庆幸中间很长一段路程乘坐了空间传送阵，不然半路它就会被折腾死。
en_us: The journey from Central City to Ebony Plum Town filled it to the brim with grief. Perhaps it ought to rejoice that it had traveled most of the way by a Dimensional Transport circle or it would have been tormented to death while halfway through the journey.

source: 从乌梅镇到中心城用空间符和话太奢侈，而且定位的准确度不高，所以打听完乌梅镇的情况后，三人就决定搭乘小型空间传送阵前往中心城。
en_us: Since it was too extravagant to use teleportation talismans to travel from Plum Crow Town to the Central City and the accuracy of the landing was low, the three decided to take a small scale Dimensional Transport circle to the Central City after inquiring about the situation in Plum Crow Town.

source: 从凌霄上次晋级到现在已经过了好多个月，焦谷附近早已没有人，因此不用担心会有人突然闯进这里，而且他们还有一个免费的护法。
en_us: Many months had already passed since the last time Ling Xiao had risen in rank. There hadn't been people for a long time now around the scorched valley, so they didn't have to worry about someone suddenly barging in here. Plus, they had a free guardian.

source: 从十级到彩级一品是一个蜕变的过程，难度比平时增加了一倍不止，是一道将很多有潜力的丹师阻挡在十级的巨大障碍，所以他需要更多的能量。
en_us: From level ten to rainbow grade one was a proces of metamorphasis, the difficulty at least doubled that of the usual. It was a huge obstacle standing in the way of many talented mages, thus he needed more energy.

source: 从外面看不知道，走进去才发现像个大型商场，到处都是摆摊卖灵草的卖家，而且越往里面走，灵草的等级就越高。
en_us: You couldn't tell from the outside, but inside it was a huge market place, full of stalls that sold magic herbs. And the further one went in, the higher quality the magic herbs.

source: 从来只有黑蜘蛛阴人，这次反倒是阴沟里翻船，这种滋味让他颇不爽，想他在黑蜘蛛里也是数一数二的强者，除了压在他头上的人，谁人敢不敬畏他，如今却在这里连续吃瘪。
en_us: The Black Spider had always been the one stabbing people in the back, but this time the tables were turned on them. This kind of feeling put him in a rather bad mood. He was also one of the strongest experts in the Black Spider. There was none who dared not fear him besides the people who ranked higher than him, but now he had been continuously humiliated here.

source: 从武成刚刚报的价，游小默就猜到他买的这些灵草实际花费的灵晶应该都是低于市价的，所以他这句话相当于给武成回扣，他能用低于市价多少收购就看他自己的本事了。
en_us: Given the earlier price, You XiaoMo figured that he bought those herbs at a lower rate than market price so, he was basically giving the difference as commission. As for how much discount he could buy them at, that was up to him.

source: 从河镇到鲸岛一般要十天左右，如果刚好遇到顺海流，不用五天就能到达了，这次出海，河镇的人显然已经计算好。
en_us: It usually took about ten days to get from River Town to Whale Island. They would be able to get there in less than five days if they happened to encounter favorable ocean currents. The people of River Town had clearly calculated the time it would take for the journey this time.

source: 从表面上看，凌霄的气势明显不如游震天，特别是当他的猛虎出现后，气势和灵力仿佛节节攀升，一下子爆表了。
en_us: Ling Xiao's aura was clearly inferior to You ZhenTian's on the surface, especially when You ZhenTian's fierce tiger (猛虎) appeared, his aura and spiritual power seemed to climb step by step, before it suddenly went off the charts.

source: 从西境边缘到鬼冢山脉有一段很长的距离。
en_us: The distance from the fringes of Xi Jing to the Ghost Tomb Mountain Ranges was very far.

source: 从那之后他就不敢再怠慢了。
en_us: From then on, he did not dare to neglect it any more.

source: 从陆地走过去显然不可能，走空中也很危险，刚刚那只黑鹰就是在冲出黑雾后又被强行拉了回去，不过两者一比还是空中的危险系数要低一些。
en_us: It was impossible to walk across the ground, but it was also very dangerous to go through the air. Just now, that black hawk had been forcefully dragged back in after it had flown out of the black fog. However, after comparing, they realized that the likelihood of danger in the air was still a little lower.

source: 仔细一想，他就猜到江流在打什么主意了，想法是不错，但是运气很重要。
en_us: After some contemplation, he had managed to figure out what Jiang Liu wanted to do. He had a good idea, but luck was important.

source: 他怕星罗城主会听到他们的谈话，所以话不敢说得太白。
en_us: Afraid that the City Master would hera their words, he couldn't be too straightforwards.

source: 他、下一秒先将所有九级灵草都扔进炉鼎里，当他把大部分杂质都提取出来后，又按照丹方上说明的将部分灵草绿液分成数份，接着再把十级灵草扔进去，动作到目前为止都很流畅。
en_us: Then, he threw all of the level nine magic herbs into the cauldron. When he took out most of the impurities, he then followed the recipe to split the green magic herb liquid to sections. After that, he threw all of the level ten magic herbs in. Up till now, his movements were very smooth and fluid.

source: 他不就站在你身后。”
en_us: "Isn't he standing right behind you?"

source: 他不想让别人知道他住在好来客栈，在镇上转了几圈，将一些尾巴甩掉后才无声无息的回到客栈。
en_us: As he did not want anyone to know that he stayed in the inn, he walked around the town a few times and threw off some tails before silently returning to the inn.

source: 他不是大善人，不可能因为饭菜被别人吃了就重新跟他们做一顿，而且在这之前他还给过灵晶。
en_us: He wasn't a saint; he couldn't go and teach those guys a lesson just because they ate someone else's food, and those people had compensated the two for it with a spirit gem, too.

source: 他不知道的是，唐中华以为他把龙血偷走了，而龙血也是他们的目标，自然不能让他拿走。
en_us: He did not know that Tang ZhongHua was under the impression that he had stolen the dragon blood. Since the dragon blood was his objective, he naturally could not let You XiaoMo take it away.

source: 他与刑七是两万年的同伴，二人一直在一起，各种恶事几乎都是一起做的，他从来没想过刑七会死在他面前。
en_us: He had been partners with Xing Qi for twenty thousand years, they had always been together, doing evil deeds. He had never once thought that Xing Qi would die before him.

source: 他之前没想到刑七会来得这么快，正要顺着人流跑出城门就听到刑七的吼声，动作稍微一顿就被他追上了。
en_us: Before, he hadn't thought that Xing Qi would've caught up so quickly, because just as he was about to follow the crowd out, he heard Xing Qi's roar. With just a slight delay in movement, he was caught up.

source: 他也是有钱人家的少爷，而且有个对餐桌礼仪非常讲究的母亲，怎么说在这行也浸淫了十几年，可他就是做不到快速的优雅，记忆中，游柏和游路也是这样，难道这玩意真是天分的问题？
en_us: He was also from a wealthy family with a mother that cared deeply about table manners. More or less he had been in that environment for fifteen or so years, so why couldn't he be fast and elegant? As he recalled, You Bo and You Lu was also like Ling Xiao. Was this really a matter of talent?

source: 他亲眼看到一颗果核打中强盗头子的手，而且果核飞过来的方向与谢俊一群人的方向是相反的。
en_us: He had personally witnessed a fruit pit hit the bandit chief's hand with his own eyes. Moreover, the fruit pit came from the opposite direction of Xie Jun's group.

source: 他从小就被人称赞为通天大陆第一天才，眼下他的前途更是越来越辉煌，他已经完全把这个称号套在自己的头上，如今颜辉却说他不是大陆第一天才，让他如何相信！
en_us: He was praised as the Number One Genius in the TongTian Continent from an early age. He had completely taken the title as his possession now that his future was becoming even more brilliant. Yet, Yan Hui was saying that he was not the Number One Genius of TongTian Continent, how could he believe it!

source: 他从没想过自己会死得这么干脆与轻易，可惜后悔已经来不及了，内丹被拿走他这次是活不了了。
en_us: He had never thought that he would have died so easily and cleanly, but it was too late. With his (内丹) being stolen, there was no way he would've survived.

source: 他们不准备在自然城待太长时间，吃过饭后就准备离开了，至于皮球他们，进城前就约好一个时辰后在城门外等着。
en_us: They were not intending to stay in the Nature City for too long and were planning to leave after they ate. As for PiQiu and the rest, they agreed to meet outside the city gates in an hour before they entered the city.

source: 他们与游小默相处过，早上又是他帮忙把成熟的灵草挖出来的，那么好相处的一个人，老夫妇决定信他一次。
en_us: They had interacted with You XiaoMo before, and it was him who had helped them dig up all the magic herbs in the morning. The old couple decided to trust this good-natured young man.

source: 他们与麒麟族没有结过仇恨，虽然以麒麟族对凌霄的态度，他们的关系不可能会好，但现在纯粹是麒昊武看他们不顺眼。
en_us: They had never made enemies with the Qilin Clan, although judging from their attitude towards Ling Xiao, it was never going to be good. Now, however, was simply Lin HaoWu being disagreeable.

source: 他们二人刚好在前面，本来想回鬼哭涯，听到声音才又返回来。
en_us: The two of them happened to some distance ahead and were intending to return to the Weeping Ghost Shore, but turned back upon hearing the roar.

source: 他们以为是天狗的人制造的，因为这片区是天狗的地盘，而且也就只有他们才有这等本事。
en_us: They were under the impression that this scene was created by people from Tengu as this was their territory, furthermore, they were the only ones who had the ability to do this.

source: 他们刚进入宫殿不就这东西就启动了，虽然被人捷足先登，但是一个独立空间却够本了。
en_us: It wasn't long before they entered the palace when the trap activated, so even though someone came before them, getting this independent dimension was more than enough to make up for it.

source: 他们在小岛呆了一个多月，别说人影，就连鬼影都没有见到一个，可以想象这座小岛有多么偏僻。
en_us: They had stayed here for over a month, there wasn't a shadow, not even a a ghost of a shadow here. From that, one could tell how remote this island was.

source: 他们在空间里捣鼓禁制玉简的时候，外面已经天亮了，六十层的人陆陆续续跑去修炼所修炼，走廊只剩下零散几道人影。
en_us: Dawn had arrived on the outside while they were fiddling with the sealed jade drive in their dimension. One after another, the people on the sixtieth level people hurried to the Cultivation Institute to cultivate, leaving only a few scattered figures in the corridor.

source: 他们在这座小岛已经呆了不止两个月，外面的情形什么都不知道，虽然他不着急，但是若能知道一些外面的情况就好了，毕竟他们也不是完全无牵无挂。
en_us: They had been on this island for more than two months and did not know the situation in the outside world. Although he was not in a hurry, it would be nice to know some news about the outside world. After all, they were not completely free of all constraints and attachments.

source: 他们好歹是神境四星的强者，结果竟然毫无招架之力？
en_us: In any case, they were still four star Divine Realm experts. But they didn't have any ability to fight back?

source: 他们并不知道，凌霄体内还有玄龟的血脉，玄龟虽然不是水属性的妖兽，但是他们世代生存在活水河界，对水的操纵虽然没有白虎厉害，但绝对是数一数二的，他所传承的记忆中就有不少是关于如何灵活控水的方法。
en_us: What they did not know was that Ling Xiao had the bloodline of the Black Tortoise within his body. Although the Black Tortoise was not a demon beast with a water attribute, they had lived in the Living Waters River Boundary for many generations. Their ability to manipulate water was definitely one of the best even if it was not a good as the White Tiger. Many of his inherited memories concerned methods on how to flexibly control water (灵活控水).

source: 他们并不知道，半刻钟后，天狗的人也出现在这片土地上。
en_us: They did not know that the members of the Tengu also appeared on this piece of land 8 minuets later.

source: 他们并没有可以躲藏，知道他们真容的人很少，而且没人想到在这种关头，他们中间还会多出一个人。
en_us: They didn't need to hid or be sneaky since not many knew of their true faces. Not only that, most wouldn't expect them to add an extra person in their party at such a critical time.

source: 他们并没有怀疑昨天的饭菜是游小默做的。
en_us: They had not suspected that the food from yesterday was made by You XiaoMo.
